avr-rust/avrd/packs/atmega/ATmega8515.atdf
      <value-group caption="" name="ENUM_BOOTSZ">
        <value caption="Boot Flashsize=128 words Boot address=$0F80" name="128W_0F80" value="0x03"/>
        <value caption="Boot Flash size=256 words Boot address=$0F00" name="256W_0F00" value="0x02"/>
        <value caption="Boot Flash size=512 words Boot address=$0E00" name="512W_0E00" value="0x01"/>
        <value caption="Boot Flash size=1024 words Boot address=$0C00" name="1024W_0C00" value="0x00"/>
      </value-group>
    </module>
    <module caption="Lockbits" name="LOCKBIT">
      <register-group caption="Lockbits" name="LOCKBIT">
        <register caption="" name="LOCKBIT" offset="0x00" size="1">
          <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
          <bitfield caption="Boot Loader Protection Mode" mask="0x0C" name="BLB0" values="ENUM_BLB"/>
          <bitfield caption="Boot Loader Protection Mode" mask="0x30" name="BLB1" values="ENUM_BLB2"/>
        </register>
      </register-group>
      <value-group caption="" name="ENUM_LB">
        <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
        <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
        <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
      </value-group>
      <value-group caption="" name="ENUM_BLB">
        <value caption="LPM and SPM prohibited in Application Section" name="LPM_SPM_DISABLE" value="0x00"/>
        <value caption="LPM prohibited in Application Section" name="LPM_DISABLE" value="0x01"/>
        <value caption="SPM prohibited in Application Section" name="SPM_DISABLE" value="0x02"/>
        <value caption="No lock on SPM and LPM in Application Section" name="NO_LOCK" value="0x03"/>
      </value-group>
      <value-group caption="" name="ENUM_BLB2">
        <value caption="LPM and SPM prohibited in Boot Section" name="LPM_SPM_DISABLE" value="0x00"/>
        <value caption="LPM prohibited in Boot Section" name="LPM_DISABLE" value="0x01"/>
        <value caption="SPM prohibited in Boot Section" name="SPM_DISABLE" value="0x02"/>
        <value caption="No lock on SPM and LPM in Boot Section" name="NO_LOCK" value="0x03"/>
      </value-group>
    </module>
    <module caption="Analog Comparator" name="AC">
      <register-group caption="Analog Comparator" name="AC">
        <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x28" size="1" ocd-rw="R">
          <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
          <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
          <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
          <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
          <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
          <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
          <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="USART" name="USART">
      <register-group caption="USART" name="USART">
        <register caption="USART I/O Data Register" name="UDR" offset="0x2C" size="1" mask="0xFF"/>
        <register caption="USART Control and Status Register A" name="UCSRA" offset="0x2B" size="1">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC"/>
          <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE"/>
          <bitfield caption="Data overRun" mask="0x08" name="DOR"/>
          <bitfield caption="Parity Error" mask="0x04" name="UPE"/>
          <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSRB" offset="0x2A" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE"/>
          <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
          <bitfield caption="Character Size Bit 2" mask="0x04" name="UCSZ2"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB8"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB8"/>
        </register>
        <register caption="USART Control and Status Register C" name="UCSRC" offset="0x40" size="1">
          <bitfield caption="Register Select" mask="0x80" name="URSEL"/>
          <bitfield caption="USART Mode Select" mask="0x40" name="UMSEL" values="COMM_USART_MODE"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size Bits" mask="0x06" name="UCSZ"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL"/>
        </register>
        <register caption="USART Baud Rate Register High Byte" name="UBRRH" offset="0x40" size="1">
          <bitfield caption="Register Select" mask="0x80" name="URSEL"/>
          <bitfield caption="USART Baud Rate Register bit 11" mask="0x0C" name="UBRR1"/>
          <bitfield caption="USART Baud Rate Register bits" mask="0x03" name="UBRR" lsb="8"/>
        </register>
        <register caption="USART Baud Rate Register Low Byte" name="UBRRL" offset="0x29" size="1" mask="0xFF"/>
      </register-group>
