avr-rust/avrd/packs/atmega/ATmega8515.atdf
      <value-group caption="" name="COMM_USART_MODE">
        <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
        <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
      </value-group>
      <value-group caption="" name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="VAL_0x00" value="0x00"/>
        <value caption="2-bit" name="VAL_0x01" value="0x01"/>
      </value-group>
    </module>
    <module caption="Serial Peripheral Interface" name="SPI">
      <register-group caption="Serial Peripheral Interface" name="SPI">
        <register caption="SPI Data Register" name="SPDR" offset="0x2F" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="SPI Status Register" name="SPSR" offset="0x2E" size="1" ocd-rw="R">
          <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
          <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
          <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
        </register>
        <register caption="SPI Control Register" name="SPCR" offset="0x2D" size="1">
          <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
          <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
          <bitfield caption="Data Order" mask="0x20" name="DORD"/>
          <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
          <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
          <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE_3BIT"/>
        </register>
      </register-group>
      <value-group caption="" name="COMM_SCK_RATE_3BIT">
        <value caption="fosc/4" name="VAL_0x00" value="0x00"/>
        <value caption="fosc/16" name="VAL_0x01" value="0x01"/>
        <value caption="fosc/64" name="VAL_0x02" value="0x02"/>
        <value caption="fosc/128" name="VAL_0x03" value="0x03"/>
        <value caption="fosc/2" name="VAL_0x04" value="0x04"/>
        <value caption="fosc/8" name="VAL_0x05" value="0x05"/>
        <value caption="fosc/32" name="VAL_0x06" value="0x06"/>
        <value caption="fosc/64" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
        <register caption="Extended MCU Control Register" name="EMCUCR" offset="0x56" size="1">
          <bitfield caption="Sleep Mode Select Bit 0" mask="0x80" name="SM0"/>
          <bitfield caption="Wait State Selector Limit bits" mask="0x70" name="SRL" values="CPU_SECTOR_LIMITS"/>
          <bitfield caption="Wait State Select Bits for Lower Sector, bits" mask="0x0C" name="SRW0" values="CPU_WAIT_STATES"/>
          <bitfield caption="Wait State Select Bits for Upper Sector, bit 1" mask="0x02" name="SRW11"/>
          <bitfield caption="Interrupt Sense Control 2" mask="0x01" name="ISC2"/>
        </register>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="External SRAM/XMEM Enable" mask="0x80" name="SRE"/>
          <bitfield caption="Wait State Select Bits for Upper Sector, bit 0" mask="0x40" name="SRW10"/>
          <bitfield caption="Sleep Enable" mask="0x20" name="SE"/>
          <bitfield caption="Sleep Mode Select Bit 1" mask="0x10" name="SM1"/>
          <bitfield caption="Interrupt Sense Control 1 Bits" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL2"/>
          <bitfield caption="Interrupt Sense Control 0 Bits" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL2"/>
        </register>
        <register caption="MCU Control And Status Register" name="MCUCSR" offset="0x54" size="1">
          <bitfield caption="Sleep Mode Select Bit 2" mask="0x20" name="SM2"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x24" size="1" mask="0xFF">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="Store Program Memory Control Register" name="SPMCR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read-While-Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Read-While-Write Section Read Enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
        <register caption="Special Function IO Register" name="SFIOR" offset="0x50" size="1">
          <bitfield caption="External Memory Bus Keeper Enable" mask="0x40" name="XMBK"/>
          <bitfield caption="External Memory High Mask Bits" mask="0x38" name="XMM"/>
          <bitfield caption="Pull-up Disable" mask="0x04" name="PUD"/>
          <bitfield caption="Prescaler Reset Timer / Counter 1 and Timer / Counter 0" mask="0x01" name="PSR10"/>
        </register>
      </register-group>
      <value-group caption="" name="CPU_SECTOR_LIMITS">
        <value caption="LS = N/A, US = 0x1100 - 0xFFFF" name="VAL_0x00" value="0x00"/>
        <value caption="LS = 0x1100 - 0x1FFF, US = 0x2000 - 0xFFFF" name="VAL_0x01" value="0x01"/>
        <value caption="LS = 0x1100 - 0x3FFF, US = 0x4000 - 0xFFFF" name="VAL_0x02" value="0x02"/>
        <value caption="LS = 0x1100 - 0x5FFF, US = 0x6000 - 0xFFFF" name="VAL_0x03" value="0x03"/>
        <value caption="LS = 0x1100 - 0x7FFF, US = 0x8000 - 0xFFFF" name="VAL_0x04" value="0x04"/>
        <value caption="LS = 0x1100 - 0x9FFF, US = 0xA000 - 0xFFFF" name="VAL_0x05" value="0x05"/>
        <value caption="LS = 0x1100 - 0xBFFF, US = 0xC000 - 0xFFFF" name="VAL_0x06" value="0x06"/>
        <value caption="LS = 0x1100 - 0xDFFF, US = 0xE000 - 0xFFFF" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="CPU_WAIT_STATES">
        <value caption="No wait-states" name="VAL_0x00" value="0x00"/>
        <value caption="Wait one cycle during read/write strobe" name="VAL_0x01" value="0x01"/>
        <value caption="Wait two cycles during read/write strobe" name="VAL_0x02" value="0x02"/>
        <value caption="Wait two cycles during read/write and wait one cycle before driving out new address" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="INTERRUPT_SENSE_CONTROL2">
        <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
        <value caption="Any Logical Change in INTX" name="VAL_0x01" value="0x01"/>
        <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
        <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="1 Mhz" name="1_Mhz"/>
        <value value="0x01" caption="2 Mhz" name="2_Mhz"/>
        <value value="0x02" caption="4 Mhz" name="4_Mhz"/>
        <value value="0x03" caption="8 Mhz" name="8_Mhz"/>
      </value-group>
      <parameters>
        <param name="CORE_VERSION" value="V2E"/>
      </parameters>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="General Interrupt Control Register" name="GICR" offset="0x5B" size="1">
          <bitfield caption="External Interrupt Request 0 Enable" mask="0x40" name="INT0"/>
          <bitfield caption="External Interrupt Request 1 Enable" mask="0x80" name="INT1"/>
          <bitfield caption="External Interrupt Request 2 Enable" mask="0x20" name="INT2"/>
          <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
          <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
        </register>
