avr-rust/avrd/packs/atmega/ATmega8515.atdf
        <register caption="General Interrupt Flag Register" name="GIFR" offset="0x5A" size="1">
          <bitfield caption="External Interrupt Flags" mask="0xC0" name="INTF"/>
          <bitfield caption="External Interrupt Flag 2" mask="0x20" name="INTF2"/>
        </register>
      </register-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control Register" name="WDTCR" offset="0x41" size="1">
          <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
          <bitfield caption="Watch Dog Timer Prescaler bits" mask="0x07" name="WDP" values="WDOG_TIMER_PRESCALE_3BITS"/>
        </register>
      </register-group>
      <value-group caption="" name="WDOG_TIMER_PRESCALE_3BITS">
        <value caption="Oscillator Cycles 16K" name="VAL_0x00" value="0x00"/>
        <value caption="Oscillator Cycles 32K" name="VAL_0x01" value="0x01"/>
        <value caption="Oscillator Cycles 64K" name="VAL_0x02" value="0x02"/>
        <value caption="Oscillator Cycles 128K" name="VAL_0x03" value="0x03"/>
        <value caption="Oscillator Cycles 256K" name="VAL_0x04" value="0x04"/>
        <value caption="Oscillator Cycles 512K" name="VAL_0x05" value="0x05"/>
        <value caption="Oscillator Cycles 1024K" name="VAL_0x06" value="0x06"/>
        <value caption="Oscillator Cycles 2048K" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 8-bit" name="TC8">
      <register-group caption="Timer/Counter, 8-bit" name="TC0">
        <register caption="Timer/Counter 0 Control Register" name="TCCR0" offset="0x53" size="1">
          <bitfield caption="Force Output Compare" mask="0x80" name="FOC0"/>
          <bitfield caption="Waveform Generation Mode 0" mask="0x40" name="WGM00" values="WAVEFORM_GEN_MODE"/>
          <bitfield caption="Compare Match Output Modes" mask="0x30" name="COM0"/>
          <bitfield caption="Waveform Generation Mode 1" mask="0x08" name="WGM01"/>
          <bitfield caption="Clock Selects" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter 0 Register" name="TCNT0" offset="0x52" size="1" mask="0xFF"/>
        <register caption="Timer/Counter 0 Output Compare Register" name="OCR0" offset="0x51" size="1" mask="0xFF"/>
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x59" size="1">
          <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x02" name="TOIE0"/>
          <bitfield caption="Timer/Counter0 Output Compare Match Interrupt register" mask="0x01" name="OCIE0"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x02" name="TOV0"/>
          <bitfield caption="Output Compare Flag 0" mask="0x01" name="OCF0"/>
        </register>
      </register-group>
      <value-group caption="" name="WAVEFORM_GEN_MODE">
        <value caption="Normal" name="VAL_0x00" value="0x00"/>
        <value caption="PWM, Phase Correct" name="VAL_0x02" value="0x02"/>
        <value caption="CTC" name="VAL_0x01" value="0x01"/>
        <value caption="Fast PWM" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 16-bit" name="TC16">
      <register-group caption="Timer/Counter, 16-bit" name="TC1">
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x59" size="1">
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x80" name="TOIE1"/>
          <bitfield caption="Timer/Counter1 Output CompareA Match Interrupt Enable" mask="0x40" name="OCIE1A"/>
          <bitfield caption="Timer/Counter1 Output CompareB Match Interrupt Enable" mask="0x20" name="OCIE1B"/>
          <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x08" name="TICIE1"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x80" name="TOV1"/>
          <bitfield caption="Output Compare Flag 1A" mask="0x40" name="OCF1A"/>
          <bitfield caption="Output Compare Flag 1B" mask="0x20" name="OCF1B"/>
          <bitfield caption="Input Capture Flag 1" mask="0x08" name="ICF1"/>
        </register>
        <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x4F" size="1">
          <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
          <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
          <bitfield caption="Force Output Compare for Channel A" mask="0x08" name="FOC1A"/>
          <bitfield caption="Force Output Compare for Channel B" mask="0x04" name="FOC1B"/>
          <bitfield caption="Pulse Width Modulator Select Bits" mask="0x03" name="WGM1"/>
        </register>
        <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x4E" size="1">
          <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
          <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
          <bitfield caption="Pulse Width Modulator Select Bits" mask="0x18" name="WGM1" lsb="2"/>
          <bitfield caption="Clock Select1 bits" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT"/>
        </register>
